import { Alert, Linking } from 'react-native';

export const sundayFullData = [
    ['06:45, 07:15', 'תחנה מרכזית רציף 1', 'חצור'],
    ['06:15, 06:45', 'מרכז ביג מול BBB', 'כרמיאל',],
    ['06:15 עד 07:30 כל רבע שעה', 'קהילת עציון תחנה מרכזית', 'עפולה'],
    ['07:00, 07:30', 'מתחם יצחקי', 'כפר יונה'],
    ['6:30 עד 8:30 כל חצי שעה', 'תחנת רכבת הרצליה', 'הרצליה'],
    ['07:00, 07:30, 07:45, 08:00, 08:30', 'חניון אוטובוסים ע"י שער צפון', 'שיבא תל השומר'],
    ['07:30, 08:00', 'מרכז גוזלן', 'גדרה'],
    ['07:00, 07:05, 07:10, 07:20, 07:30, 07:35, 07:45, 08:00, 08:15', 'אצטדיון המושבה', 'פתח תקווה'],
    ['07:15 עד 09:00 כל רבע שעה', 'מסוף שרת (סמוך לפארק פרס)', 'חולון'],
    ['07:00 עד 08:45 כל רבע שעה', 'ראשון לציון תחנת רכבת ראשונים', 'ראשון לציון מזרח'],
    ['07:00 עד 08:30 כל רבע שעה', `רח' ילדי טהרן (מצפון ובצמוד לסינמה סיטי)`, 'ראשון לציון מערב'],
    ['07:15, 07:30 עד 08:30 כל 10 דקות', 'מסוף הלר בצמוד לתחנת רכבת', 'רחובות'],
    ['08:30', 'תחנה מרכזית רציף 12', 'אשקלון'],
    ['07:15 עד 08:45 כל רבע שעה', 'ליד בית חב"ד בצמוד לתחנה המרכזית', 'אשדוד'],
    ['07:00 עד 08:15 כל רבע שעה', 'מסוף עירוני', 'מודיעין'],
    ['08:00', 'תחנת אגד', 'אילת'],
    ['07:30 עד 08:30 כל חצי שעה', 'מרכז חינוכי חבל מודיעין', 'שהם'],
    ['07:00, 08:00', 'שדרות הראל (מול קניון הראל)', 'מבשרת ציון'],
    ['07:00, 07:15, 07:30 עד 09:00 כל חצי שעה', 'חניון גבעת התחמושת', 'ירושלים צפון'],
    ['06:45, 07:00, 07:30, 08:00, 08:30, 08:45, 09:00', 'חניון טדי מול שער 23', 'ירושלים דרום'],
    ['07:30, 08:00, 08:30', 'כניסה לתחנת רכבת', 'בית שמש'],
    ['08:00 עד 10:56 עם הגעת הרכבת לתחנה', 'חניון רכבת באר שבע צפון אוניברסיטה', 'באר שבע צפון'],
    ['07:00 עד 12:50 מתמלא ויוצא', 'תחנה מרכזית', 'באר שבע מרכז'],
];

export const thursdayFullData = [
    ['12:30, 13:00, 13:30, 15:00', 'קריית שמונה עצירה בחצור ויקנעם'],
    ['13:30, 15:00', 'גדרה'],
    ['12:30, 13:30, 15:00', 'עפולה'],
    ['12:30 עד 16:00 כל חצי שעה, 17:00', 'חיפה'],
    ['13:30, 14:00, 15:00, 16:00', 'כפר יונה, עצירה סופית בנתניה'],
    ['13:30, 14:00, 15:00, 16:00, 16:30', 'הרצליה'],
    ['13:30, 13:45, 14:00 עד 17:00 כל חצי שעה', 'תל אביב'],
    ['13:30 עד 16:00 כל חצי שעה', 'פתח תקווה'],
    ['13:30, 14:00, 15:00, 16:00', 'חולון'],
    ['13:30 עד 16:00 כל חצי שעה', 'ראשון לציון מזרח'],
    ['13:30, 13:45, 14:00 עד 17:00 כל חצי שעה', 'ירושלים'],
    ['13:30, 14:00, 15:00, 16:00', 'מודיעין'],
    ['13:15', 'אילת'],
    ['13:30, 14:00, 15:00, 16:00 ', 'אשדוד'],
    ['13:30, 15:00 ', 'בית שמש, רמלה'],
    ['14:00, 14:15, 14:20, 14:30, 14:45, 15:15, 15:20, 15:30, 15:45, 16:00, 16:15, 16:30, 16:45, 17:00, 17:30', 'באר שבע'],
    ['13:30, 15:00', 'אשקלון, קריית גת'],
    ['13:30, 15:00', 'כפר סבא'],
    ['13:30, 15:00', 'בנימינה'],
];

export const fridayFullData = [
    ['07:00, 08:00', 'קריית שמונה (עוצר בחצור)'],
    ['07:00, 08:00', 'עפולה'],
    ['07:00 עד 08:30 כל חצי שעה', 'חיפה'],
    ['07:00, 08:00', 'בנימינה'],
    ['07:00, 08:00', 'כפר יונה'],
    ['07:00, 08:00', 'כפר סבא'],
    ['07:00, 08:00', 'הרצליה'],
    ['07:00, 08:00', 'פתח תקווה'],
    ['07:00 עד 08:30 כל חצי שעה', 'תל אביב'],
    ['07:00, 08:00', 'חולון'],
    ['07:00, 08:00', 'ראשון לציון מזרח'],
    ['07:00 עד 08:30 כל חצי שעה', 'ירושלים'],
    ['07:00, 08:00', 'מודיעין'],
    ['07:00, 08:00', 'אשדוד'],
    ['07:00, 08:00', 'אשקלון'],
    ['07:00', 'בית שמש'],
    ['07:15, 07:30, 07:45, 08:15, 08:30, 09:00, 09:30', 'באר שבע'],
    ['07:15', 'אילת'],
];

export const callNumber = (phone,) => {
    //console.log('callNumber ----> ', phone);
    let phoneNumber = phone;
    if (Platform.OS !== 'android') {
        phoneNumber = `telprompt:${phone}`;
    }
    else if(Platform.OS === 'android') {
        phoneNumber = `tel:${phone}`;
    }
    if(phoneNumber.includes('@')) {
        phoneNumber = `mailto:${phone}`;
    }
    
    Linking.canOpenURL(phoneNumber)
        .then(supported => {
            if (!supported) {
                Alert.alert('Phone number is not available');
            } else {
                return Linking.openURL(phoneNumber);
            }
        })
        .catch(err => console.log(err));
};